app/Helpers/analytics_helper.php

    function product_analytics()
    {


        $analytics = [
            "total" => 0,
            "active" => 0,
            "inactive" => 0,
            "in_stock" => 0,
            "out_of_stock" => 0,
            "special_today" => 0,
            "analytics" => []
        ];

        $product = new ProductModel();

        $products = $product->findAll();

        $active_products = $product->where('p_is_live', 1)->findAll();

        $inactive_products = $product->where('p_is_live', 0)->findAll();

        $special_products = $product->where('p_is_special_today', 1)->findAll();
---
SELECT *
FROM `products`
SELECT *
FROM `products`
WHERE `p_is_live` = 1
SELECT *
FROM `products`
WHERE `p_is_live` = 0
SELECT *
FROM `products`
WHERE `p_is_special_today` = 1

    function category_analytics()
    {

        $analytics = [
            "total" => 0,
            "active" => 0,
            "inactive" => 0,
        ];

        $category = new CategoryModel();

        $all_categories = $category->findAll();
---
SELECT *
FROM `categories`