app/Helpers/utility_helper.php

SELECT *
FROM `users`
WHERE `users`.`u_id` = '2'
---
    function user_full_name($user_id)
    {

        $user = new UserModel();

        $u = $user->find($user_id);