app/Controllers/Authentication.php

SELECT *
FROM `users`
WHERE `u_email_address` = 'abhisharma290996@gmail.com'
 LIMIT 1
---
    public function checkLogin()
    {

        $email = $this->request->getVar('email');
        $password = $this->request->getVar('password');

        $user = new UserModel();

        $u = $user->where('u_email_address', $email)->asObject()->first();