app/Models/ProductModel.php

SELECT COUNT(p_name) as total_products, `p_is_live`, MONTHNAME(p_created_at) as p_month
FROM `products`
WHERE YEAR(p_created_at) = '2023'
GROUP BY MONTHNAME(p_created_at)
---
    function get_monthly_data()
    {

        $db      = \Config\Database::connect();
        $builder = $db->table($this->table);

        $pr = $builder->select('COUNT(p_name) as total_products, p_is_live , MONTHNAME(p_created_at) as p_month')
            ->groupBy('MONTHNAME(p_created_at)')
            ->where('YEAR(p_created_at)', date('Y'))
            ->get()->getResultArray();